app/controllers/charge_controller.rb

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "subscriptions" ("project_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["project_id", 1], ["user_id", 3], ["created_at", "2016-05-26 17:11:05.689543"], ["updated_at", "2016-05-26 17:11:05.689543"]]
---
def pay
    project = Project.find(params[:project_id])

    customer = Stripe::Customer.create(
      :email => current_user.email,
      :card  => params[:stripeToken]
    )

    charge = Stripe::Charge.create(
      :customer    => customer.id,
      :amount      => project.price_in_cents,
      :description => project.name,
      :currency    => 'usd'
    )

    if charge
      current_user.subscriptions.create(project: project)